adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51G18A.PIC
      <edc:AdjustPoint edc:_addr="0x4000101D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001020" edc:access="nnnnnnnn" edc:cname="DFLLCTRLB" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode Selection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STABLE" edc:desc="Stable DFLL Frequency" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LLAW" edc:desc="Lose Lock After Wake" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBCRM" edc:desc="USB Clock Recovery Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCDIS" edc:desc="Chill Cycle Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QLDIS" edc:desc="Quick Lock Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BPLCKC" edc:desc="Bypass Coarse Lock" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WAITLOCK" edc:desc="Wait Lock" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001021" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001024" edc:access="nnnnnnnnnnnnnnnnnnnnnn--nnnnnnnn" edc:cname="DFLLVAL" edc:impl="0xFFFFFCFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FINE" edc:desc="Fine Value" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COARSE" edc:desc="Coarse Value" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="DIFF" edc:desc="Multiplication Ratio Difference" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001028" edc:access="nnnnnn--nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DFLLMUL" edc:impl="0xFCFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="MUL" edc:desc="DFLL Multiply Factor" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="FSTEP" edc:desc="Fine Maximum Step" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CSTEP" edc:desc="Coarse Maximum Step" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000102C" edc:access="---nnnn-" edc:cname="DFLLSYNC" edc:impl="0x1E" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ENABLE Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLCTRLB" edc:desc="DFLLCTRLB Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLVAL" edc:desc="DFLLVAL Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DFLLMUL" edc:desc="DFLLMUL Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000102D" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001030" edc:access="nn----n-" edc:cname="DPLL0DPLLCTRLA" edc:impl="0xC2" edc:mclr="10000000" edc:nzwidth="0x8" edc:por="10000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DPLL Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="On Demand Control" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40001031" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40001034" edc:access="-----------nnnnn---nnnnnnnnnnnnn" edc:cname="DPLL0DPLLRATIO" edc:impl="0x1F1FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LDR" edc:desc="Loop Divider Ratio" edc:nzwidth="0xD"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="LDRFRAC" edc:desc="Loop Divider Ratio Fractional Part" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001038" edc:access="-----nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DPLL0DPLLCTRLB" edc:impl="0x7FFFFFF" edc:mclr="00000000000000000000000000100000" edc:nzwidth="0x20" edc:por="00000000000000000000000000100000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Proportional Integral Filter Selection" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="FILTER1" edc:desc="Bandwidth = 92.7Khz and Damping Factor = 0.76" edc:when="(field &amp; 0xF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FILTER2" edc:desc="Bandwidth = 131Khz and Damping Factor = 1.08" edc:when="(field &amp; 0xF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FILTER3" edc:desc="Bandwidth = 46.4Khz and Damping Factor = 0.38" edc:when="(field &amp; 0xF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="FILTER4" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 0.54" edc:when="(field &amp; 0xF) == 3"/>
              <edc:SFRFieldSemantic edc:cname="FILTER5" edc:desc="Bandwidth = 131Khz and Damping Factor = 0.56" edc:when="(field &amp; 0xF) == 4"/>
              <edc:SFRFieldSemantic edc:cname="FILTER6" edc:desc="Bandwidth = 185Khz and Damping Factor = 0.79" edc:when="(field &amp; 0xF) == 5"/>
              <edc:SFRFieldSemantic edc:cname="FILTER7" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 0.28" edc:when="(field &amp; 0xF) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FILTER8" edc:desc="Bandwidth = 92.7Khz and Damping Factor = 0.39" edc:when="(field &amp; 0xF) == 7"/>
              <edc:SFRFieldSemantic edc:cname="FILTER9" edc:desc="Bandwidth = 46.4Khz and Damping Factor = 1.49" edc:when="(field &amp; 0xF) == 8"/>
              <edc:SFRFieldSemantic edc:cname="FILTER10" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 2.11" edc:when="(field &amp; 0xF) == 9"/>
              <edc:SFRFieldSemantic edc:cname="FILTER11" edc:desc="Bandwidth = 23.2Khz and Damping Factor = 0.75" edc:when="(field &amp; 0xF) == 10"/>
              <edc:SFRFieldSemantic edc:cname="FILTER12" edc:desc="Bandwidth = 32.8Khz and Damping Factor = 1.06" edc:when="(field &amp; 0xF) == 11"/>
              <edc:SFRFieldSemantic edc:cname="FILTER13" edc:desc="Bandwidth = 65.6Khz and Damping Factor = 1.07" edc:when="(field &amp; 0xF) == 12"/>
              <edc:SFRFieldSemantic edc:cname="FILTER14" edc:desc="Bandwidth = 92.7Khz and Damping Factor = 1.51" edc:when="(field &amp; 0xF) == 13"/>
              <edc:SFRFieldSemantic edc:cname="FILTER15" edc:desc="Bandwidth = 32.8Khz and Damping Factor = 0.53" edc:when="(field &amp; 0xF) == 14"/>
              <edc:SFRFieldSemantic edc:cname="FILTER16" edc:desc="Bandwidth = 46.4Khz and Damping Factor = 0.75" edc:when="(field &amp; 0xF) == 15"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="WUF" edc:desc="Wake Up Fast" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFCLK" edc:desc="Reference Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Dedicated GCLK clock reference" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="XOSC32" edc:desc="XOSC32K clock reference" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="XOSC0" edc:desc="XOSC0 clock reference" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="XOSC1" edc:desc="XOSC1 clock reference" edc:when="(field &amp; 0x7) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LTIME" edc:desc="Lock Time" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DEFAULT" edc:desc="No time-out. Automatic lock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="800US" edc:desc="Time-out if no lock within 800us" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="900US" edc:desc="Time-out if no lock within 900us" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="1MS" edc:desc="Time-out if no lock within 1ms" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="1P1MS" edc:desc="Time-out if no lock within 1.1ms" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LBYPASS" edc:desc="Lock Bypass" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCOFILTER" edc:desc="Sigma-Delta DCO Filter Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="FILTER1" edc:desc="Capacitor(pF) = 0.5 and Bandwidth Fn (MHz) = 3.21" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="FILTER2" edc:desc="Capacitor(pF) = 1 and Bandwidth Fn (MHz) = 1.6" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FILTER3" edc:desc="Capacitor(pF) = 1.5 and Bandwidth Fn (MHz) = 1.1" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="FILTER4" edc:desc="Capacitor(pF) = 2 and Bandwidth Fn (MHz) = 0.8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="FILTER5" edc:desc="Capacitor(pF) = 2.5 and Bandwidth Fn (MHz) = 0.64" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="FILTER6" edc:desc="Capacitor(pF) = 3 and Bandwidth Fn (MHz) = 0.55" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="FILTER7" edc:desc="Capacitor(pF) = 3.5 and Bandwidth Fn (MHz) = 0.45" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="FILTER8" edc:desc="Capacitor(pF) = 4 and Bandwidth Fn (MHz) = 0.4" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DCOEN" edc:desc="DCO Filter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DIV" edc:desc="Clock Divider" edc:nzwidth="0xB"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000103C" edc:access="-----------------------------rr-" edc:cname="DPLL0DPLLSYNCBUSY" edc:impl="0x6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="DPLL Enable Synchronization Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DPLLRATIO" edc:desc="DPLL Loop Divider Ratio Synchronization Status" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001040" edc:access="------------------------------rr" edc:cname="DPLL0DPLLSTATUS" edc:impl="0x3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="OSCCTRL">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="OSCCTRL">
            <edc:SFRFieldDef edc:cname="LOCK" edc:desc="DPLL Lock Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKRDY" edc:desc="DPLL Clock Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
