adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51G18A.PIC
      <edc:SFRDef edc:_addr="0x4100A185" edc:access="------nn" edc:cname="CHANNEL20CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A186" edc:access="------nn" edc:cname="CHANNEL20CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A187" edc:access="------rr" edc:cname="CHANNEL20CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A188" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100A190" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL21CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A194" edc:access="------nn" edc:cname="CHANNEL21CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A195" edc:access="------nn" edc:cname="CHANNEL21CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A196" edc:access="------nn" edc:cname="CHANNEL21CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A197" edc:access="------rr" edc:cname="CHANNEL21CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A198" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100A1A0" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL22CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1A4" edc:access="------nn" edc:cname="CHANNEL22CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1A5" edc:access="------nn" edc:cname="CHANNEL22CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1A6" edc:access="------nn" edc:cname="CHANNEL22CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1A7" edc:access="------rr" edc:cname="CHANNEL22CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A1A8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100A1B0" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL23CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1B4" edc:access="------nn" edc:cname="CHANNEL23CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1B5" edc:access="------nn" edc:cname="CHANNEL23CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1B6" edc:access="------nn" edc:cname="CHANNEL23CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1B7" edc:access="------rr" edc:cname="CHANNEL23CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A1B8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100A1C0" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL24CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1C4" edc:access="------nn" edc:cname="CHANNEL24CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A1C5" edc:access="------nn" edc:cname="CHANNEL24CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
