adafruit/seesaw/lib/samd51/samd51a/edc/ATSAMD51G18A.PIC
      <edc:SFRDef edc:_addr="0x4100A226" edc:access="------nn" edc:cname="CHANNEL30CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A227" edc:access="------rr" edc:cname="CHANNEL30CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A228" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4100A230" edc:access="----------------nn--nnnn-nnnnnnn" edc:cname="CHANNEL31CHANNEL" edc:impl="0xCF7F" edc:mclr="00000000000000001000000000000000" edc:nzwidth="0x20" edc:por="00000000000000001000000000000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="EVGEN" edc:desc="Event Generator Selection" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:desc="Path Selection" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:desc="Edge Detection Selection" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Generic Clock On Demand" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A234" edc:access="------nn" edc:cname="CHANNEL31CHINTENCLR" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A235" edc:access="------nn" edc:cname="CHANNEL31CHINTENSET" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A236" edc:access="------nn" edc:cname="CHANNEL31CHINTFLAG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="OVR" edc:desc="Channel Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD" edc:desc="Channel Event Detected" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4100A237" edc:access="------rr" edc:cname="CHANNEL31CHSTATUS" edc:impl="0x3" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="DMAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DMAC">
            <edc:SFRFieldDef edc:cname="RDYUSR" edc:desc="Ready User" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BUSYCH" edc:desc="Busy Channel" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4100A238" edc:offset="0x1E48"/>
      <edc:SFRDef edc:_addr="0x4100C080" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS0PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C084" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS0PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C088" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS1PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C08C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS1PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C090" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS2PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C094" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS2PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C098" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS3PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C09C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS3PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0A0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS4PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0A4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS4PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0A8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS5PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0AC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS5PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0B0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS6PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0B4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS6PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0B8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS7PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0BC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS7PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0C0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS8PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0C4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS8PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0C8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS9PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0CC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS9PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0D0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS10PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS10PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0D8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS11PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0DC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS11PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0E0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS12PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS12PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0E8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS13PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0EC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS13PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0F0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS14PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0F4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS14PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0F8" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS15PRAS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:SFRDef edc:_addr="0x4100C0FC" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="PRS15PRBS" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="HMATRIX"/>
      <edc:AdjustPoint edc:_addr="0x4100C100" edc:offset="0x1F00"/>
      <edc:SFRDef edc:_addr="0x4100E000" edc:access="-------n" edc:cname="CTRLA" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
